# Create a data frame which contains name and age of workshop participants(random age)-both dictionary and list

In [1]:
import pandas as pd

In [6]:
import random

In [7]:
wrk_shp={"name":["adnan","nemi","rashid","yasir"],"age":[random.randint(20,40) for i in range(4)]}
wrk_shp

{'name': ['adnan', 'nemi', 'rashid', 'yasir'], 'age': [31, 40, 31, 27]}

In [8]:
pd.DataFrame(wrk_shp)

     name  age
0   adnan   31
1    nemi   40
2  rashid   31
3   yasir   27

In [13]:
name=["ami","nemi","remi"]
age=[random.randint(20,40) for i in range(4)]
df=pd.DataFrame(list(zip(name,age)),columns=("name","age"))
df

   name  age
0   ami   39
1  nemi   23
2  remi   38

# Read 5 different data sets and perform basics tasks

In [14]:
import pandas as pd

# 1.Indian states dataset

In [17]:
df=pd.read_csv("datasetgov.csv")
df

,State,District,Total Gram Panchayats,Service Ready Gram Panchayats
0,ANDAMAN AND NICOBAR ISLANDS,NICOBARS,8,7
1,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,37,37
2,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,30,30
3,ANDHRA PRADESH,ANANTAPUR,1044,996
4,ANDHRA PRADESH,CHITTOOR,1412,1193
...,...,...,...,...
711,WEST BENGAL,NADIA,185,185
712,WEST BENGAL,PASCHIM BARDHAMAN,62,56
713,WEST BENGAL,PURBA BARDHAMAN,215,116
714,WEST BENGAL,PURULIA,170,170
715,Total,NaN,262489,208099

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 716 entries, 0 to 715
Data columns (total 4 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   State                          716 non-null    object
 1   District                       715 non-null    object
 2   Total Gram Panchayats          716 non-null    int64
 3   Service Ready Gram Panchayats  716 non-null    int64
dtypes: int64(2), object(2)
memory usage: 22.5+ KB

In [19]:
df.head()

,State,District,Total Gram Panchayats,Service Ready Gram Panchayats
0,ANDAMAN AND NICOBAR ISLANDS,NICOBARS,8,7
1,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,37,37
2,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,30,30
3,ANDHRA PRADESH,ANANTAPUR,1044,996
4,ANDHRA PRADESH,CHITTOOR,1412,1193

In [20]:
df.size

2864

In [21]:
df.shape

(716, 4)

In [22]:
df.columns

Index(['State ', 'District', 'Total Gram Panchayats',
       'Service Ready Gram Panchayats'],
      dtype='object')

# 2.placement dataset

In [24]:
df=pd.read_csv("disease/placement-dataset.csv")
df

           city  cgpa     iq  placement
0      New York   6.8  123.0          1
1   Los Angeles   5.9  106.0          0
2       Chicago   NaN  121.0          0
3      New York   7.4  132.0          1
4   Los Angeles   5.8  142.0          0
..          ...   ...    ...        ...
95      Chicago   4.3  200.0          0
96     New York   4.4   42.0          0
97  Los Angeles   6.7  182.0          1
98      Chicago   6.3  103.0          1
99     New York   6.2  113.0          1

[100 rows x 4 columns]

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   city       100 non-null    object
 1   cgpa       92 non-null     float64
 2   iq         96 non-null     float64
 3   placement  100 non-null    int64
dtypes: float64(2), int64(1), object(1)
memory usage: 3.3+ KB

In [26]:
df.size

400

In [27]:
df.shape

(100, 4)

In [28]:
df.columns

Index(['city', 'cgpa', 'iq', 'placement'], dtype='object')

In [29]:
df.head()

          city  cgpa     iq  placement
0     New York   6.8  123.0          1
1  Los Angeles   5.9  106.0          0
2      Chicago   NaN  121.0          0
3     New York   7.4  132.0          1
4  Los Angeles   5.8  142.0          0

In [30]:
df.tail()

           city  cgpa     iq  placement
95      Chicago   4.3  200.0          0
96     New York   4.4   42.0          0
97  Los Angeles   6.7  182.0          1
98      Chicago   6.3  103.0          1
99     New York   6.2  113.0          1

# 3.Disease dataset

In [32]:
df=pd.read_csv("disease/emotion_sentimen_dataset.csv")
df

        Unnamed: 0                                               text  Emotion
0                0  i seriously hate one subject to death but now ...     hate
1                1                 im so full of life i feel appalled  neutral
2                2  i sit here to write i start to dig out my feel...  neutral
3                3  ive been really angry with r and i feel like a...    anger
4                4  i feel suspicious if there is no one outside l...  neutral
...            ...                                                ...      ...
839550      839550  i feel like telling these horny devils to find...  neutral
839551      839551  i began to realize that when i was feeling agi...  neutral
839552      839552  i feel very curious be why previous early dawn...  neutral
839553      839553  i feel that becuase of the tyranical nature of...  neutral
839554      839554  i think that after i had spent some time inves...  neutral

[839555 rows x 3 columns]

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 839555 entries, 0 to 839554
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  839555 non-null  int64
 1   text        839555 non-null  object
 2   Emotion     839555 non-null  object
dtypes: int64(1), object(2)
memory usage: 19.2+ MB

In [34]:
df.head()

   Unnamed: 0                                               text  Emotion
0           0  i seriously hate one subject to death but now ...     hate
1           1                 im so full of life i feel appalled  neutral
2           2  i sit here to write i start to dig out my feel...  neutral
3           3  ive been really angry with r and i feel like a...    anger
4           4  i feel suspicious if there is no one outside l...  neutral

In [35]:
df.tail()

        Unnamed: 0                                               text  Emotion
839550      839550  i feel like telling these horny devils to find...  neutral
839551      839551  i began to realize that when i was feeling agi...  neutral
839552      839552  i feel very curious be why previous early dawn...  neutral
839553      839553  i feel that becuase of the tyranical nature of...  neutral
839554      839554  i think that after i had spent some time inves...  neutral

In [36]:
df.size

2518665

In [37]:
df.shape

(839555, 3)

In [38]:
df.columns

Index(['Unnamed: 0', 'text', 'Emotion'], dtype='object')

# 4.disease outbreak dataset

In [39]:
df=pd.read_csv("disease/Big-Data-Analysis-Diseases-Outbreaks/final.csv")
df

      Unnamed: 0        date region     score
0              0  2009-01-01     AU -0.527608
1              1  2009-01-01     BF -0.735117
2              2  2009-01-01     BW -0.747728
3              3  2009-01-01     CF -0.500000
4              4  2009-01-01     CH -0.554464
...          ...         ...    ...       ...
8055        8055  2020-04-16     SA -0.614940
8056        8056  2020-04-16     UA -0.632255
8057        8057  2020-04-16     VE -0.519230
8058        8058  2020-04-16     VN -0.632896
8059        8059  2020-04-16     ZA -0.601664

[8060 rows x 4 columns]

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8060 entries, 0 to 8059
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  8060 non-null   int64
 1   date        8060 non-null   object
 2   region      8060 non-null   object
 3   score       8060 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 252.0+ KB

In [41]:
df.size

32240

In [42]:
df.shape

(8060, 4)

In [43]:
df.columns

Index(['Unnamed: 0', 'date', 'region', 'score'], dtype='object')

In [44]:
df.head()

   Unnamed: 0        date region     score
0           0  2009-01-01     AU -0.527608
1           1  2009-01-01     BF -0.735117
2           2  2009-01-01     BW -0.747728
3           3  2009-01-01     CF -0.500000
4           4  2009-01-01     CH -0.554464

# 5.dataset

In [46]:
df=pd.read_csv("disease/anomaly.csv")
df

      Unnamed: 0        date region     score
0              0  2009-01-01     AU -0.527608
1              1  2009-01-01     BF -0.735117
2              2  2009-01-01     BW -0.747728
3              3  2009-01-01     CF -0.500000
4              4  2009-01-01     CH -0.554464
...          ...         ...    ...       ...
8055        8055  2020-04-16     SA -0.614940
8056        8056  2020-04-16     UA -0.632255
8057        8057  2020-04-16     VE -0.519230
8058        8058  2020-04-16     VN -0.632896
8059        8059  2020-04-16     ZA -0.601664

[8060 rows x 4 columns]

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8060 entries, 0 to 8059
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  8060 non-null   int64
 1   date        8060 non-null   object
 2   region      8060 non-null   object
 3   score       8060 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 252.0+ KB

In [48]:
df.size

32240

In [49]:
df.shape

(8060, 4)

# write a csv frm tsv and excel

# TSV to CSV

In [50]:
t=pd.read_table("pandas_docs/titan.csv")
t

                                        ,Name,Survived
0                        0,"Braund, Mr. Owen Harris",0
1    1,"Cumings, Mrs. John Bradley (Florence Briggs...
2                         2,"Heikkinen, Miss. Laina",1
3    3,"Futrelle, Mrs. Jacques Heath (Lily May Peel...
4                       4,"Allen, Mr. William Henry",0
..                                                 ...
886                      886,"Montvila, Rev. Juozas",0
887               887,"Graham, Miss. Margaret Edith",1
888  888,"Johnston, Miss. Catherine Helen ""Carrie"...
889                      889,"Behr, Mr. Karl Howell",1
890                        890,"Dooley, Mr. Patrick",0

[891 rows x 1 columns]

In [51]:
t.to_csv("survivers.csv")

In [52]:
pd.read_csv("survivers.csv")

     Unnamed: 0                                     ,Name,Survived
0             0                      0,"Braund, Mr. Owen Harris",0
1             1  1,"Cumings, Mrs. John Bradley (Florence Briggs...
2             2                       2,"Heikkinen, Miss. Laina",1
3             3  3,"Futrelle, Mrs. Jacques Heath (Lily May Peel...
4             4                     4,"Allen, Mr. William Henry",0
..          ...                                                ...
886         886                      886,"Montvila, Rev. Juozas",0
887         887               887,"Graham, Miss. Margaret Edith",1
888         888  888,"Johnston, Miss. Catherine Helen ""Carrie"...
889         889                      889,"Behr, Mr. Karl Howell",1
890         890                        890,"Dooley, Mr. Patrick",0

[891 rows x 2 columns]

# EXCEL TO CSV

In [54]:
e=pd.read_excel("pandas_docs/myexcel")
e

   rttts shjhhjh
0   nemi      30
1  adnan      30
2  yasir      30
3    jdj   kddlk

In [55]:
e.to_csv("new.csv")

In [56]:
pd.read_csv("new.csv")

   Unnamed: 0  rttts shjhhjh
0           0   nemi      30
1           1  adnan      30
2           2  yasir      30
3           3    jdj   kddlk

# Read Dataset from various sources

# Dataset from kaggle

In [57]:
pd.read_csv("jobplacement.csv")

,id,name,gender,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
0,1,John Doe,Male,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
1,2,Jane Smith,Female,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
2,3,Michael Johnson,Male,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
3,4,Emily Davis,Female,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
4,5,David Brown,Male,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0
...,...,...,...,...,...,...,...,...,...,...,...
695,696,Lucas Taylor,Male,23,Bachelor's,Computer Science,University of Washington,Placed,67000,3.8,3.0
696,697,Emma Martinez,Female,26,Bachelor's,Electronics and Communication,University of California--Berkeley,Placed,66000,3.9,3.0
697,698,Aiden Davis,Male,24,Bachelor's,Computer Science,University of Illinois--Urbana-Champaign,Placed,65000,3.8,3.0
698,699,Mia Wilson,Female,23,Bachelor's,Electrical Engineering,University of Colorado--Boulder,Placed,66000,3.7,2.0
699,700,Jack Garcia,Male,26,Bachelor's,Information Technology,University of North Carolina--Chapel Hill,Not Placed,0,3.6,1.0

# Dataset from gov.in

In [58]:
pd.read_csv("datasetgov.csv")

,State,District,Total Gram Panchayats,Service Ready Gram Panchayats
0,ANDAMAN AND NICOBAR ISLANDS,NICOBARS,8,7
1,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,37,37
2,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,30,30
3,ANDHRA PRADESH,ANANTAPUR,1044,996
4,ANDHRA PRADESH,CHITTOOR,1412,1193
...,...,...,...,...
711,WEST BENGAL,NADIA,185,185
712,WEST BENGAL,PASCHIM BARDHAMAN,62,56
713,WEST BENGAL,PURBA BARDHAMAN,215,116
714,WEST BENGAL,PURULIA,170,170
715,Total,NaN,262489,208099

# from github

In [59]:
pd.read_csv("disease/anomaly.csv")

      Unnamed: 0        date region     score
0              0  2009-01-01     AU -0.527608
1              1  2009-01-01     BF -0.735117
2              2  2009-01-01     BW -0.747728
3              3  2009-01-01     CF -0.500000
4              4  2009-01-01     CH -0.554464
...          ...         ...    ...       ...
8055        8055  2020-04-16     SA -0.614940
8056        8056  2020-04-16     UA -0.632255
8057        8057  2020-04-16     VE -0.519230
8058        8058  2020-04-16     VN -0.632896
8059        8059  2020-04-16     ZA -0.601664

[8060 rows x 4 columns]